
// 1 Додайте data-src атрибут до тегів img, який містить посилання на зображення, яке необхідно завантажити.


// 2 Додайте CSS стилі, які забезпечують мінімальну висоту тегів img та фоновий колір для видимих зображень, які ще не завантажені. 


// 3 img { height: 200px; background-color: #f0f0f0; }


// 4 Створіть JavaScript-файл та імпортуйте IntersectionObserver.


// 5 Встановіть IntersectionObserver для кожного зображення з data-src атрибутом, яке потрібно завантажити.


// 6 Для кожного зображення, яке стає видимим, змініть його src атрибут на data-src та перестаньте спостерігати його.


// 7 Додайте додаткову функціональність, таку як анімацію завантаження або зображення-заповнювач, щоб покращити користувацький досвід.


// 8 Додатково, не обов’язково! Оптимізуйте завантаження зображень за допомогою WebP формату або скейлінга зображень до відповідної роздільної здатності, щоб зменшити обсяг завантажуваної інформації.


// 9 Перевірте результати за допомогою інструментів розробника браузера, таких як "Network" або "Performance", щоб переконатися, що зображення завантажуються тільки тоді, коли вони стають видимими на сторінці.


// 10 Додайте можливість завантажувати зображення тільки при натисканні на кнопку або при іншій дії користувача.


// 11 Запустіть сайт на різних пристроях та перевірте, чи працює лінійне завантаження зображень, коли користувач прокручує сторінку.


// 12 Залиште коментарі в коді, щоб пояснити, як він працює та як можна його покращити в майбутньому.


















//створюємо екземпляр
const imageObserver = new IntersectionObserver ((item, observer) => {
    //масив всіх елементів за яким ми стежимо
    item.forEach((newImg) => {
        //перевіряємо чи елемент перетнув межу екрана
        if(newImg.isIntersecting){
            //з атрибуту data-src перекидуємо в src
            newImg.target.src = newImg.target.dataset.src 
            //візуальний ефект зміщення картимнки в початкову позицію
            newImg.target.style.transform = "translateX(0)"
            //припинити стежити за цією картинкою (вроді)
            observer.unobserve(newImg.target)
        }
    })
}, {
    //почати завантаження за 50px до того як користувач доскролить
    rootMargin: "50px"
})


//знайти всі img на сторінці
const imgArray = document.querySelectorAll("img")


//до кожної картинки запускати спостерігач
imgArray.forEach((img) => imageObserver.observe(img))